Revit 2027 API
View.IsTemporaryViewPropertiesModeEnabled Method
 Returns true when Temporary View Properties mode is in progress, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTemporaryViewPropertiesModeEnabled()
Public Function IsTemporaryViewPropertiesModeEnabled As Boolean
public:
bool IsTemporaryViewPropertiesModeEnabled()
member IsTemporaryViewPropertiesModeEnabled : unit -> bool
Return Value
Boolean
See Also
Reference
View Class
Autodesk.Revit.DB Namespace